[
  {
    "full_urn": "urn:li:activity:7402578320082796544",
    "text": "Had shared this few months back. Update on this- we are investing in Praan Health and supporting Navneeth to solve for elder care in India. Massive opportunity that needs patient capital.",
    "url": "https://www.linkedin.com/posts/dilipevs_had-shared-this-few-months-back-update-on-activity-7402578320082796544-I_Bn?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7401119303774793728",
    "text": "Everyone is experiencing brain fog. Including you. Stop scrolling, stop watching stupid reels, unfollow the nonsense, get out of the rubbish whatsapp groups, keep your phone away for atleast few hours a day, make something you’re proud of, help people without them asking, stop wasting time on gossip & outrage, choose what actually matters, protect your time, invest in your health, create more than you consume. Read a book. Save yourself.",
    "url": "https://www.linkedin.com/posts/dilipevs_everyone-is-experiencing-brain-fog-including-activity-7401119303774793728-sX8F?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7396777492012945408",
    "text": "Amul has evolved from a dairy to a nutrition brand and is probably the most underrated case study in modern day business. They did a revenue of 90,000cr in FY25. Hard to think of another company in the world that has done something similar. Notes on what i think they got right..\n\n1) They innovate at cooperative speed not startup speed and still wins. Launched 250 product launches in 5 years and that's crazy speed for a cooperative with millions of farmers, 18000+ village societies, and government-linked processes. Most companies will shiver at this speed.\n\n2) They turned cold chain into a moat decades before most startups spoke about supply chain tech. They run India’s largest cold supply chain with refrigeration networks across rural area and temperature controlled logistics in small towns. This single capability lets them enter any nutrition category quickly.\n\n3) The nutrition transition feels like farmer driven. More milk production means surplus fat & SNF (casien, whey , lactose) and therefore opportunity to create value added products. Every new category like whey, chocolates, drinks, cheese, creates more value for farmers. Most nutrition brands optimise for margins but they optimise for farmer income.\n\n4) Amul is probably the only brand that simultaneously sells mass and premium products all under same brand,  same dairy and distribution and with same trust. Their products range for Rs 5 to 500. Most brands split into sub brands while Amul let the trust carry everything.\n\nNo obsession with burn, CAC ,CM1/2 growth and branding. They quietly proved that trust, scale and farmer first thinking can still beat everyone.",
    "url": "https://www.linkedin.com/posts/dilipevs_amul-has-evolved-from-a-dairy-to-a-nutrition-activity-7396777492012945408-sVKw?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7394638641383452672",
    "text": "15–20% of medicines in India are fake or substandard. Pharma is a $58Billion market. This is not fear mongering but a reminder that your health shouldn’t rely on what comes in tablets. \n\nPrevention is still the cheapest, safest, and most authentic form of healthcare.\n\nMove daily. Eat clean.Sleep well. Manage stress. Get regular blood work.\n\nBuild a life where you don’t need medicines often.",
    "url": "https://www.linkedin.com/posts/dilipevs_1520-of-medicines-in-india-are-fake-or-activity-7394638641383452672-qNyS?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7389586926720344066",
    "text": "Boss had sent this internal message a few days back. Take a print and frame it.",
    "url": "https://www.linkedin.com/posts/dilipevs_boss-had-sent-this-internal-message-a-few-activity-7389586926720344066-iVlp?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7375035321044049920",
    "text": "America just put a $100,000 price tag on the Indian dream. Never been a better time than now for Indian engineers to build at home. The US was the promised land for Indian engineers but not anymore. And India isn’t the India of the 90s when engineers moved out for better pay and exposure. \n\nEarlier generations left India because they didn’t have a choice. Today, staying back is the smarter choice. The US is telling the world that they want fewer immigrants, at higher prices & under tighter conditions. \n\nIn the 1960s & 70s, US actively recruited Indian doctors and engineers to fill shortages. In the 90s & 2000s, IT/software outsourcing made H-1B the obvious path for thousands of engineers. In reality, the India of today is not the India many left behind. \n\nThis is not to say India is without its own constraints. We still have infrastructure gaps and bureaucracy is still frustrating.\nBut if you look back at history, Indian engineers have always thrived precisely in moments of constraint. \n\nThe outsourcing opportunity of the 90s was born from wage arbitrage. The SaaS opportunity of the 2010s came from building global software with frugal & distributed teams. Each cycle has taken adversity and Indian entrepreneurs turned it into advantage.\n\nThe next cycle will be no different. The very inefficiencies of India around fragmented supply chains, healthcare gaps, broken education models will be the anchor to build world class companies. To solve for India is to solve for the future of other emerging markets.\n\nThis is the great inversion of our time and for the first time in history, the opportunity cost of leaving India may be greater than the opportunity cost of staying.\n\nThe last generation of Indian engineers built America’s tech backbone. The next generation has the chance to build India’s. Come back home. Time to build for India and from India.",
    "url": "https://www.linkedin.com/posts/dilipevs_america-just-put-a-100000-price-tag-on-activity-7375035321044049920-Is9K?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7368508498621431810",
    "text": "Call me crazy but, I’m on a mission to create a community of 100 founders in India by end of this year who lift weights & runs a few days a week. Will never compromise on sleep and family time. And takes pride in being a happy & satisfied entrepreneur. Nothing else matters.",
    "url": "https://www.linkedin.com/posts/dilipevs_call-me-crazy-but-im-on-a-mission-to-create-activity-7368508498621431810-vaJg?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7365618821707071488",
    "text": "Every day I see posts about why people want to leave India. India isn’t perfect, but no country is. I think before self driving cars or AI chips, we first need to improve quality of life here. \n\nImagine if more of us built tools for public good in health & climate that make daily life better. Rainmatter/Zerodha will back and build this together.\n\nWhat’s one problem you face daily that you wish had a simple solution?",
    "url": "https://www.linkedin.com/posts/dilipevs_every-day-i-see-posts-about-why-people-want-activity-7365618821707071488-I7jd?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7363088962380328961",
    "text": "15months back i told a founder to not raise VC money. Yesterday he emailed me saying they’re profitable and on track to do $2M. Sharing this here as a reminder that not every founder needs an investor. Some just need to hear the truth and have the belief. Be like Sid!",
    "url": "https://www.linkedin.com/posts/dilipevs_15months-back-i-told-a-founder-to-not-raise-activity-7363088962380328961-W2kv?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7360538503241195521",
    "text": "At Rainmatter-Zerodha, we’re keen to meet people building or passionate about Deeptech in India. The last 15 yrs were consumer apps. The next wave is Deeptech moats. If we don’t build this now, we’ll be depending on others for what matters most. \n\nWho should we talk and learn from?",
    "url": "https://www.linkedin.com/posts/dilipevs_at-rainmatter-zerodha-were-keen-to-meet-activity-7360538503241195521-NJ2h?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7357997583023165440",
    "text": "At this point i feel there are more protein brands than protein consumers 😅\n\nEvery protein brand is now- Lab tested, doctor recommended & clinically backed.\n\nBy 2026, every Indian will either launch a protein powder or be in one 😀\n\nAs a consumer, sure eat appropriate protein. But do it with purpose, not propaganda. Nutrition isn’t about being part of a trend.",
    "url": "https://www.linkedin.com/posts/dilipevs_at-this-point-i-feel-there-are-more-protein-activity-7357997583023165440-AKTe?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7352599276381753345",
    "text": "Founders Peak by Rainmatter- Zerodha. \n60+ founders met for 2hrs today morning doing just one thing- working on their physical and mental fitness. No pitch decks. No filters. Just founders, showing up.\n\nThis isn’t just for our portfolio. It’s for every founder in India-whether you’re funded by us, by someone else, or by no one at all. You just have to show up. \n\nWe are coming to Gurgaon (July 26th) & Mumbai (August 2nd). \n\nComment below if you want to join and you’ll get an invite link.",
    "url": "https://www.linkedin.com/posts/dilipevs_founders-peak-by-rainmatter-zerodha-60-activity-7352599276381753345-6XNj?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7351838960739905536",
    "text": "Every week, I get a 10 new startup pitches that says “We’ll deliver healthcare in 10 minutes.” Quick commerce is now rushing into healthcare. So I thought to do a breakdown on what’s hype and what might actually work in India. \n\nWhat could work?\n1)30–60 min medicine delivery can work for chronic refills or acute needs. In metros with dense demand, it's useful. But 10-min isn’t necessary. Even same-day is fine for 90% of use cases. And honestly, your local chemist is already doing that.\n\n2) Rapid diagnostics for home blood collection isn’t about speed but it’s about hygiene and reliability. A 2-hour sample pickup and next-morning results is a solid win. What we need is better logistics and trained phlebotomists, not faster scooters.\n\n3)On-demand nursing or paramedic visits but for use cases like wound care, IV, injections. Could work with proper scheduling. Think “Ola for nurses,” not “Blinkit for bandages.” Needs backend infra for verification, training, EMR integration.\n\nWhat won’t work (At least not now)\n1) Ambulance in 10 mins sounds great until you hit Delhi or Bangalore traffic. Speed is useless without triage and location accuracy. What we really need is better coordination between hospitals and ambulance providers, not just faster wheels.\n\n2) On-demand doctors in 10 mins is a bad idea. You don’t need any doctor fast but you need the right one. Discovery & matching are bigger problems than speed. Most video consults struggle with quality, not timing. Clinical care isn’t fast food. Trust takes time.\n\n3) The 10-min everything app for healthcare is lazy ambition dressed up with VC money. Healthcare isn’t a SKU game but it’s complex, regulated, and hard to standardize like groceries. Great for funding buzz, terrible for trust and real outcomes.\n\nFew thoughts if you really are passionate to build in healthcare. \nTrust > velocity.\nSpeed isn’t everything.\nInfra & people ops > APIs.\nReliability > 10-min hacks.\nHealth is longitudinal & not transactional.\n\nGood luck if you're building something in Healthcare in India.",
    "url": "https://www.linkedin.com/posts/dilipevs_every-week-i-get-a-10-new-startup-pitches-activity-7351838960739905536-0_m4?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7350035959809253376",
    "text": "2020: Sent a cold email to Nithin Kamath and raised capital.\n2023: Working alongside him to back other founders.\n\nBuilt a few startups. Shut some down.\nNow backing founders who are braver than I was.\nThis is usually my answer when someone asks me to introduce myself.\n\nThanks to the good folks at GrowthX® unbundling some snippets from my past and present. If you're a founder and think I can be of help- just reach out.Always happy to chat.",
    "url": "https://www.linkedin.com/posts/dilipevs_2020-sent-a-cold-email-to-nithin-kamath-activity-7350036634114924544-eG2r?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7348579224074539008",
    "text": "Got a message yesterday from a friend that they lost their 7 day old baby last week. Got me thinking why this happens and turns out, it’s not uncommon.\n\nIndia’s infant mortality rate is about 25 per 1,000 births. That’s 2.5% of infants who don’t survive. The sad part is that nearly 60% of these deaths are preventable with better care. \n\nThis is where I believe AI in healthcare can truly make a difference. \nWe can develop predictive models for at-risk pregnancies using maternal health data. Build remote monitoring systems that flag early signs of preterm labor. Even use image based diagnostics to catch neonatal infections before they turn fatal.\n\nI hope more people building for healthcare in India focus on solutions that can detect risks early and save lives. No parent should lose a child to something we could’ve seen coming.",
    "url": "https://www.linkedin.com/posts/dilipevs_got-a-message-yesterday-from-a-friend-that-activity-7348579224074539008-ck2J?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7347494832988135426",
    "text": "Founders Peak by Rainmatter-Zerodha is live. Yesterday, 40+ founders came together to invest in something even more valuable than startup funding-their own mental, physical & emotional health. \n\nA random idea i posted online two weeks ago now has a shape & energy. I'll say it again- a founder’s health is the real moat of the business.\n\nThis isn’t just for our portfolio. It’s for every founder in India-whether you’re funded by us, by someone else, or by no one at all. No pitch decks. No filters. You just have to show up.\n\nWhy are we doing this? Because everyone talks about product market fit. But no one tells the founder: You are the most valuable IP in the company. Don’t burn out.\n\nWhich city should we do next? Drop your name, and we’ll send you an invite. \nLets build this peak. See you soon!",
    "url": "https://www.linkedin.com/posts/dilipevs_founders-peak-by-rainmatter-zerodha-is-live-activity-7347494833889976320-yASm?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7346770726890192897",
    "text": "Four of the world’s top ten chess players are Indians today. The mainstream media is silent, too busy parading a single sport-you know which one. This is how quiet excellence goes unnoticed while hysteria sells.\n\nThat’s why we need more independent voices- be it journalists or everyday citizens.",
    "url": "https://www.linkedin.com/posts/dilipevs_four-of-the-worlds-top-ten-chess-players-activity-7346770726890192897-p-m8?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7346040644156432386",
    "text": "Approx 68% of milk sold in India is adulterated. And this is per from government data. It isn’t just diluted with water but often spiked with- Detergent, Urea, Starch and sometimes even paint. We’re talking about the one food almost every household consumes daily, especially children.\n\nWe need a simple testing kit that any parent can use at home. \nSomeone should build this. Many lives can be saved.",
    "url": "https://www.linkedin.com/posts/dilipevs_approx-68-of-milk-sold-in-india-is-adulterated-activity-7346040644156432386-_41X?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7337710537067114496",
    "text": "Doctors in India die earlier than their patients. I know it sounds crude but what it means is Indian doctors have a life expectancy that’s nearly 10 years shorter than the average Indian. And this is reported by Indian Medical Association. \n\nThe primary causes are Cardiovascular disease and infections. Ironically, the very things they work tirelessly to prevent.\n\nEndure 10-12 years of medical education with the only aspiration to save lives but be at the receiving end of stress, anxiety, and long working hours. And be a part of a system that doesn’t give them time to care for their own health. The average Indian doctor clocks 60–80 hours a week and approx 300-400 doctors die by suicide every year. Mostly because of the impossible expectations they carry. It takes 10+ years of study before a doctor sees their first salary.\n\nThey’re taught that saving lives is everything. After 10hrs+ of work, you can then go and figure your own personal health & family life. And after all this, they’re now told that AI will make them obsolete. That their jobs will be replaced by software tools because the system is inefficient.\n\nI meet atleast 50 companies a month that pitch AI solutions for healthcare. These tools matter and they can make processes faster and improve accessibility. No doubt Indian healthcare needs better processes and better tech. But what it needs more than anything is empathy.\n\nIndia’s hospitals are crowded and the health crisis is real. But what’s also been ignored is the mental and physical health of our doctors & medical staff. \n\nThis isn’t a rant against technology, AI or healthcare system. But a reminder to self and maybe a few who are reading this that without empathy and without recognizing the human cost, there will be no healthcare system left.",
    "url": "https://www.linkedin.com/posts/dilipevs_doctors-in-india-die-earlier-than-their-patients-activity-7337710537067114496-FONf?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7337347483863265280",
    "text": "An advice from one entrepreneur to another thinking to become a founder today. Manifest this reality-it’s going to be hard. Harder than you imagine. Blogs and YouTube videos are designed to make you feel good. They’re useful, but they’re mostly made by people who seen some form of success. Don’t start thinking there’s a single linear path. The journey will be be scary and lonely.\n\nTake care of your health, both physical and mental. Walk, run, meditate, lift, cycle, swim. Just do anything. Don’t wait for a crisis. There’s no pivot for your body.\n\nDon’t take your relationships for granted. You think they’ll wait, but they won’t. And they shouldn't.  Everyone has finite time to build a life. You’re not wealthy if you have no one to share it with.\n\nLastly, don’t chase status. It’s the surest way to damage your joy and clarity. Every mistake is an opportunity to improvise. Get good at being corrected without being offended. The rest will follow if you build from a place of authenticity and love for the craft.",
    "url": "https://www.linkedin.com/posts/dilipevs_an-advice-from-one-entrepreneur-to-another-activity-7337347483863265280-es84?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7331191073827966976",
    "text": "Every investor wants to back a disruptive startup that can make money. India sees 50,000+ new startups a year. And every founder gets asked the same question- What’s new in what you’re building? \n\nMaybe it’s time founders asked VCs the same. What’s new in your fund? What edge do you bring that a thousand others don’t?\n\nPeople often ask why we cheer and share about startups we haven’t invested in. It’s because we are not just investors, we’re here to build ecosystems. And India needs that now. \n\nMost VCs love to talk about their portfolio. But the reality is, market doesn’t reward portfolios. It rewards categories. And in India, we need large movements along with unicorn outcomes. \n\nAt Rainmatter, I’ve seen hot deals been let got :). We’ve never played the status game. We support founders and even their competitors, if it helps grow the category and the narrative. When more people understand health, money, and climate and more builders create solutions-everyone wins\n\nBtw, we do podcast with founders we didn’t fund :). I share our observations and learnings openly from our portfolio companies. \n\nThere are 2000 VC funds in India. I'm hoping some of them starts thinking beyond the old Silicon Valley VC model.",
    "url": "https://www.linkedin.com/posts/dilipevs_every-investor-wants-to-back-a-disruptive-activity-7331191073827966976-kNcB?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGCAEu0BbKiDpa8cqr7EW4NkR5exUjrsREo",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7321409975757520897",
    "text": "Everyone wants to live longer, but no one wants to do the boring stuff that actually makes it happen- eat right, move and sleep well. \n\nLongevity isn’t about living forever. It’s about staying healthy and capable for as long as possible.",
    "url": "https://www.linkedin.com/posts/dilipevs_everyone-wants-to-live-longer-but-no-one-activity-7321409975757520897-kVSA?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7320312217927577600",
    "text": "Big fan of what Y Combinator has done for founders. But I’ve never understood the obsession with building a YC equivalent in India by investors here. I’m convinced it will never happen. Not because we lack talent or ambition, but because YC wasn’t just a structure. It was the outcome of a rare mix of time, place, and cultural defaults.\n\nYC emerged in a place where risk was cheap, talent was abundant, trust was a default & failure was celebrated as a credential. India has almost none of those ingredients in the same proportion yet.\n\nIndian founders are world class at surviving, hacking & stretching resources. But YC worked because it taught founders to focus on scaling instead of surviving.\nIndian early stage capital still acts like it's lending money , not taking risk. Even seed rounds come with board seats and monthly reporting. \n\nThe genius of YC was its narrative monopoly. They created status & not just capital. India’s status economy works differently. You can’t manufacture prestige in India without a IIT, IIM next to your name.\n\nIndia won’t have its YC. But maybe that’s a good thing. \nWhat we need in India is founder first micro VCs with real skin in the game. A media and narrative engine that spotlights Indian builders solving Indian and world problems from India.",
    "url": "https://www.linkedin.com/posts/dilipevs_big-fan-of-what-y-combinator-has-done-for-activity-7320312217927577600-vkSJ?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7319954426301943808",
    "text": "Because we invest in healthcare, I get this question all the time: Will AI replace doctors? As a technology optimist I don’t claim to have all the answers. But i feel this question usually reveals how little we understand both about AI & healthcare.\n\nWhen people say AI will replace doctors and teachers in the next decade. They  assume that intelligence is enough to make an impact and forgets that trust is the real currency in both healthcare and education.\n\nDoctors don’t just prescribe, they hold your hand during a cancer diagnosis. Teachers don’t just deliver content but they spot the kid falling behind, build confidence, and unlock potential. AI can assist, but it can’t replace human empathy and trust.\n\nSo is AI important? Absolutely.\nAI can read scans better than most radiologists. It can solve for homework & personalise lessons faster than a teacher. It can democratize access to world class knowledge, in any language, at near zero cost.\n\nBut can it replace the human relationship that sits at the core of these professions? AI doesn’t replace doctors. It replaces inefficiencies around them. Likewise AI won’t replace teachers. But it can free them from admin so they can actually teach\n\nTech is best when it’s invisible. When it supports human work & not erase it.\nYes, AI will change healthcare & education. The goal of AI shouldn't be to replace doctors & teachers. It’s to make a billion people feel like they finally have one. That’s the real opportunity & that’s where the best builders will focus i feel.",
    "url": "https://www.linkedin.com/posts/dilipevs_because-we-invest-in-healthcare-i-get-this-activity-7319954426301943808-Hmk7?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7312341890484289538",
    "text": "From facing financial hardships and societal rejection to winning gold for India. Conversation with Navdeep Singh",
    "url": "https://www.linkedin.com/posts/dilipevs_from-facing-financial-hardships-and-societal-activity-7312341938244829184-HTmy?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7307992167640113155",
    "text": "Everyone today loves this grand narrative that \"Tech will fix everything\". Every week a news article or investor confidently declares that tech will fix healthcare & most entrepreneurs fall for this illusion of disruption. This narrative is doing more harm than good.\n\nMost entrepreneurs today think, if we can build a beautifully designed app, use AI to chat, automate doctor-patient interactions, and scale it to millions of users, we can \"solve\" healthcare. \n\nIt sounds great in a pitch deck. It almost never works in reality.\n\nWhy? Because healthcare isn't e-commerce. You can’t scale a hospital bed like a food delivery fleet. You can’t disrupt chronic disease with a better UI. You can’t solve trust with a chatbot. Healthcare isn’t a transaction, it’s a relationship.\n\nIf you're serious about fixing healthcare, start thinking from first principles.\n\nEveryone wants to build the “Uber of Healthcare.” But Uber works because a ride from point A to B is a simple transaction. Healthcare isn’t. You can’t just match a patient with a doctor and assume the job is done. Don't build a generic doctor consultation app with a new UI or a marketplace that lists thousand doctor names. Focus on depth of care, outcomes, and follow-up treatments before chasing millions of users. Build a connected system that only focuses on driving outcomes.\n\nDon't over focus on AI without fixing the basics. AI can help a doctor diagnose faster. But it can’t replace the doctor. Yet, doctors alone won’t solve India’s healthcare crisis. They also need trained frontline workers assisted by smart tech. Build AI tools to assist doctors enable faster diagnoses. Don't oversell your AI engine or LLM models to a patient. \n\nIt doesn’t matter if we have the best doctor or AI engine if the right medicine isn’t available. Up to 20% of medicines sold in India are fake or substandard. Counterfeit drugs are a massive problem & the Pharma companies are growing this $58 billion market. Perhaps a great usecase to use AI and tech to streamline the supply chain. \n\nSo, can tech fix healthcare? Yes. \nBut not by replacing doctors, hospitals, or traditional care systems. The biggest healthcare opportunities in India are not about disruption but augmentation.\n\nTech alone won’t fix Indian healthcare. But finding the right places to apply can make a 10x difference. Healthcare isn’t an industry that gets \"disrupted\" overnight. But it can be upgraded piece by piece, solving for what really matters. And if you understand that, you’ll build something that actually works.",
    "url": "https://www.linkedin.com/posts/dilipevs_everyone-today-loves-this-grand-narrative-activity-7307992167640113155-6kKh?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7298932594161725441",
    "text": "Gopi is right. The reality is brutal—less than 1% of aspiring athletes make it big, and even those who do are left with little security once their careers are over. Sports, like startups, have a power law distribution—10% of players make 90% of the money. Everyone else is a statistic.\n\nWe love to read and watch the underdog story—the kid from nowhere who makes it to the top. But that’s survivorship bias. For every one success, there are tens of thousands who trained just as hard but got nothing. The real question is: why does sports have to be a gamble?\n\n If you’re not in the top 1%, you don’t get sponsorships, you don’t have financial security, and once your career ends—usually in your late 20’s or early 30s—you’re left scrambling for what’s next.\n\nIn developed nations, sports is a structured industry. There are leagues, second-tier careers, college scholarships, and post-career pathways. \n\nIf you don’t become an Olympic champion, you can still earn a living as a coach, analyst, trainer, or minor league player. The system doesn’t discard you the moment you’re not in the top 1%.\n\nThe problem isn’t that sports is hard—it’s that failure is absolute. An engineer who fails at a startup can get a job. A failed athlete? They often have nothing. That’s why in most countries without strong sports ecosystems, success in sports correlates with wealth. You can’t afford to be an athlete unless you can afford to lose.\n\nRight now, telling a poor kid to pursue sports is like telling them to buy lottery tickets as an investment strategy. Until we change that, Gopi’s words will remain true. And that’s a failure—not of the athletes, but of the system.\n\nA great sports system doesn’t just create champions—it creates a nation of resilient, disciplined, and competitive people. And that’s the foundation of real development.",
    "url": "https://www.linkedin.com/posts/dilipevs_gopi-is-right-the-reality-is-brutalless-activity-7298932594161725441-N31J?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7297481352231165952",
    "text": "Building a business in preventive health is hard. No one tells you this upfront. I learned it the hard way, first as a founder, now as an investor.\n\nYou’ve chosen the harder game. Not because prevention doesn’t work, but because people don’t pay for it. Most wake up thinking about chai, parathas , deadlines, and school fees. Not long-term health. People today want instant gratification—sugar today, gym tomorrow.\n\nCurative health makes money because illness is urgent. No one postpones a bypass surgery or negotiates an ICU bill. But prevention? Everyone hunts for gym discounts, coupon codes for healthy food and thinks twice before paying for a fitness program.\n\nHospitals & pharma companies thrive because they sell relief from suffering. And suffering is a guaranteed market—prevention is not.\n\nThat’s why venture money chases curative health—it scales fast with clear unit economics, solving problems people can’t ignore. Asking someone to eat better, sleep more, and exercise for a payoff 5–10 years later is like selling an FD over a lottery ticket. So accept this reality and build accordingly.\n\nYet, prevention is the hardest problem and the biggest untaped opportunity.\n#1 Healthcare in India will shift to prevention-not because people suddenly care, but because not caring is becoming too expensive. \n\n#2 Your market isn’t TAM, it’s WTM (willing-to-pay market). Everyone should care about health, but few will pay for it.To go mass-market, make it cheaper than chai and as seamless as WhatsApp.\n\n#3 If you’re selling prevention, reposition it. People don’t buy prevention. They buy status, performance, and convenience. Make it aspirational & competitive.\n\n#4 Trust in health isn’t built overnight. People won’t change their habits because you raised venture money. You’re in the business of delayed gratification. That means slow &sustainable growth.\n\n#5 If your product doesn’t make people healthier or keep them engaged long-term, the number of app downloads doesn't matter. Focus on retention, real outcomes and revenue—not GMV, DAUs or metrics to make a pitch deck look good. \n\nIf you can do this, you won’t just build a business—you’ll change how India thinks about health. And that’s worth building for.",
    "url": "https://www.linkedin.com/posts/dilipevs_building-a-business-in-preventive-health-activity-7297481352231165952-Brku?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7290235387468267520",
    "text": "Child obesity growth in India for last 25 years. Please don’t make your kids a profit machine to processed & packaged food industry. 27 million kids under the age of 18 are overweight or obese in India. \nWe’ve to fix it.\n\n#1 Don’t outsource their health to the system. The government, schools, and corporations don’t care about your child’s health. You as the parent will have to take the responsibility.\n\n#2 Play & sports is nature’s way of making kids fit. Kids are meant to run, climb & move. Don’t force them to sit for hours and then doom them to screen addiction.\n\n#3 Parents think kids should ‘want’ to exercise or eat well. But waiting for motivation is a trap. Set rules. No junk food in the house. Stock the kitchen with real food.\n\n#4 The mainstream food industry is a trap. Ads target kids. It’s all designed for short-term profit at the cost of lifelong disease. Don’t wait for policy changes. Teach your kids to think independently about health. \n\nYour child’s health is a function of their habits, not their genes. Fix the inputs, and the outputs take care of themselves.",
    "url": "https://www.linkedin.com/posts/dilipevs_child-obesity-growth-in-india-for-last-25-activity-7290235387468267520-ioSp?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7284487034633601093",
    "text": "Alcohol consumption amongst Indian men is decreasing.",
    "url": "https://www.linkedin.com/posts/dilipevs_alcohol-consumption-amongst-indian-men-is-activity-7284487034633601093-joEN?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7279724087365513218",
    "text": "Founders and startups solving for health in India, there are 1.4 billion people waiting for you to help them. Let 2025 be the year of impact. \n\nTell in few lines what you are building & solving in health. Anything that makes Indians healthy and fit both mentally and physically. \n\nCustomers, partners & investors will be reading this. \nShare about your product or services in the comment section. Make it short and precise that someone becomes interested to connect with you. \n\nGood luck to everyone for a healthy 2025!\nWe all are cheering for you at Rainmatter by Zerodha",
    "url": "https://www.linkedin.com/posts/dilipevs_founders-and-startups-solving-for-health-activity-7279724087365513218-Webg?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7272967478652104704",
    "text": "Gukesh becomes the youngest World Chess Champion in history. Millions of kids in India will get inspired today. The era of Indian chess is here 🇮🇳",
    "url": "https://www.linkedin.com/posts/dilipevs_gukesh-becomes-the-youngest-world-chess-champion-activity-7272967478652104704-Vurs?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7269582781670723585",
    "text": "By end of this year we will have invested in 35+ companies addressing health challenges in India- all within the last 18 months. India has many healthcare problems and I’m convinced the future lies with entrepreneurs trying to reduce the country’s disease burden.\n\nHave met over 600+ startups solving for health across all categories. In next few weeks, I’ll open source everything I’ve observed and learnt from the startups we invested or not. \n\nWe’ve a community for enthusiasts in health and pretty active. For builders of all kind. Come hangout with us at discuss.rainmatter.com",
    "url": "https://www.linkedin.com/posts/dilipevs_by-end-of-this-year-we-will-have-invested-activity-7269582781670723585-Sr6H?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7264142585634406401",
    "text": "An evening with 150+ entrepreneurs who want to help Indians stay healthy and fit.\n\nWe wanted to create a space for builders and entrepreneurs. No panel or expert talks but unfiltered conversations to learn and unlearn. \n\nBring a bunch of founders under one roof, let them talk to each other, give no gyaan and magic will happen.\n\nThis year we met 300+ entrepreneurs across three cities doing these meet ups. Hope to continue doing this next year in more cities and meet more builders. \n\nIf you are a founder or aspiring to be, and want to build and solve for health issues in India, come hangout with us here https://lnkd.in/gt3DNhap . Ask us what help you need and we will try to cheer for you. \nRainmatter by Zerodha",
    "url": "https://www.linkedin.com/posts/dilipevs_an-evening-with-150-entrepreneurs-who-want-activity-7264142588222291968-qP2L?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7263417762633388032",
    "url": "https://www.linkedin.com/posts/dilipevs_activity-7263417762633388032-lQLJ?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7261965818689724416",
    "text": "Being a parent is so underrated. Come home to a child who has no clue how busy your day was, how long you were stuck in traffic, how many meetings you did. All it expects is your undivided attention. \n\nYou are left with no energy but your heart wants to win this before the day ends.\n\nThe only way to play this game is to stay healthy & fit. This is the only way you will be around your family as long as you want.",
    "url": "https://www.linkedin.com/posts/dilipevs_being-a-parent-is-so-underrated-come-home-activity-7261965818689724416-fukA?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7260511431043788801",
    "text": "Don’t play these games. It’s not worth it.",
    "url": "https://www.linkedin.com/posts/dilipevs_dont-play-these-games-its-not-worth-it-activity-7260511431043788801-KpsH?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7259082264444116992",
    "text": "Entrepreneurs- if you’re building products to help people stay healthy this meetup is for you. Rainmatter is a venture fund supporting companies making products that helps Indians to stay healthy, mentally and physically.\n\nThis is the first time we’re doing a meetup in Bangalore. The last two was in Delhi and Mumbai and it was was super fun.\n\nThis is going to be casual gathering to meet founders, builders and creators building solutions in healthcare. Don’t expect panel sessions or any gyaan by experts :). The real value is in meeting other builders and exchanging notes from their experiences. You could be building in nutrition, health tech, sports or fitness. We can use the time to exchange notes and brainstorm on any problem statement you've in your startup/product. We will share our thoughts and observations of having invested in 25+ companies in health. \n\nDate : 8th November. Exact venue will be sent post signup. \n\nRegister here to attend the event : https://lu.ma/x1r4hd4m\n\nIf you know any founder in Bangalore who could come, pls share it with them. \nSee you soon :)",
    "url": "https://www.linkedin.com/posts/dilipevs_entrepreneurs-if-youre-building-products-activity-7259082264444116992-1IaC?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7253998285718241281",
    "text": "Entrepreneurs and builders in healthcare, i've 15 words for you.\nPrevent, don’t treat\nEngage, don’t shout\nProve, don’t promise\nEmpower, don’t instruct\nSimplify, don’t complicate\n\nWill elaborate- \nPrevent, don’t treat – Focus on preventive care, it’s where the future lies.\nEngage, don’t shout – Build meaningful conversations, not just sales \nEmpower, don’t instruct – Deliver users with knowledge, not rules or features.\nSimplify, don’t complicate- Make staying health easy, not overwhelming.\nProve, don’t promise – Focus on showing validation to your claims and not marketing. \n\nhttps://x.com/kmr_dilip",
    "url": "https://www.linkedin.com/posts/dilipevs_entrepreneurs-and-builders-in-healthcare-activity-7253998285718241281-CSZY?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEeiloBmkZ8ZCccA8Ma0SR3CJTUPo9wcrA",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7249647329790590976",
    "text": "Have met over 600+ healthcare startups this year at Rainmatter. These are my general observations of the sector in 2024 so far. An investor & health enthusiast perspective. \n\nRemember, these are observations and not opinions.  If you’re a builder, I'm always keen to exchange notes.\n\n1) Health tech needs maturing – The novelty phase of tech meets health is over and the focus should be on driving outcomes to the user.\n\n2) Preventive health is gaining traction – More startups are focused on preventive solutions.\n\n3) Nutrition personalisation is heating up – Companies are going beyond generic consulting and leveraging DNA, microbiome, or other personal data for nutrition recommendations.\n\n4) UPI for health not yet in India- ABDM use cases haven't seen much adoption.\n\n5) Wearables are no longer the star – Smartwatches and rings are still strong but are considered table stakes. Consumers want something that tells “why” and not limited to “what”.\n\n6) Corporate wellness is an overrated market – With rising mental health issues, stress, and burnout in the workforce, B2B wellness solutions ideally should show promise. But there isn’t adoption from corporates.\n\n7) The “biohacking” trend is niche but growing –longevity startups are speculative but hot.  Increasing interest in biohacking protocols (sleep optimization, anti ageing etc.). But the market is niche and often hard to validate scientifically unless clinical protocols are done.\n\n8) Consumer trust in health supplements is dwindling – The supplement industry lacks regulation and transparency and this has eroded trust amongst consumers. Brands are focusing on science-backed products.\n\n9) AI in healthcare – Many are bullish on AI’s potential to revolutionise diagnostics, patient care, and drug discovery, but deployment in clinical settings is slow and capital-intensive.\n\n10) Mental health is booming – Digital mental health startups, especially those offering therapy, coaching, or CBT solutions are seeing adoptions but differentiation is becoming a challenge in a crowded market.\n\n11) Community-driven fitness – Social, community-oriented fitness solutions still have potential if done right especially those blending real-world interactions with digital offerings.\n\n12) CAC is a challenge for D2C health brands – Brands are facing rising customer acquisition costs often with no sustainable GTM.\n\n13) Hybrid health businesses are scaling better – Companies combining digital and physical services have better scope of scaling fast.\n\n14) Telehealth plateaued – The initial excitement around telehealth has subsided for both consumers and investors.\n\n15) Health marketplaces have no moat – Platforms connecting consumers with healthcare providers or wellness services are overrated with no clear moat to grow.\n\nThere are more thoughts on this. Because of the word limit on Linkedin , can't post the remaining here. Read the whole list on https://lnkd.in/g-CTY4zC",
    "url": "https://www.linkedin.com/posts/dilipevs_have-met-over-600-healthcare-startups-this-activity-7249647329790590976-X6CS?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7243842175506006016",
    "text": "Bookmyshow has increased the market opportunity for meditation & mental health apps in a single day. \n\nIf you’re a mental health startup founder and need a bigger TAM & growth just get more music bands to India.\n\nIf you’re a VC and see a spike in valuations, this is the reason.",
    "url": "https://www.linkedin.com/posts/dilipevs_bookmyshow-has-increased-the-market-opportunity-activity-7243842175506006016-lRuh?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7242027721772392449",
    "text": "For the first time in two decades I’m seeing more 20 year olds saying I want to prioritise my mental & physical health than build wealth. The era of longevity has come a full circle.\n\nMost people start seeing their health deteriorate in their 30s & beyond.\n\nBecoming unhealthy is not an event. It is a process. Like losing money, losing your health is rarely caused by one thing going wrong. Usually, it is a series of ignorant and wrong doings.\n\nNo matter how much money you have, how many ESOPs you earned, how great your company’s valuation soared. \n\nIf you can’t take a walk on a random Wednesday morning or eat your breakfast without checking emails.\n\nYou’re NOT wealthy.",
    "url": "https://www.linkedin.com/posts/dilipevs_for-the-first-time-in-two-decades-im-seeing-activity-7242027721772392449-eEFR?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7240276642466521088",
    "text": "A lot of good can happen to India and our culture when more people play sports and that creates future athletes. There is a special emotion in seeing Indian flag on global sports map.\n\nIn all my conversations with professional athletes, the common request has been for consistent support for their pursuits—not just financial, but also cheering for their smaller wins and being on their side when they don't make it to the podium. \n\nIndia has the sports talent but we also need a support system and processes to guide and anchor these athletes continuously. We are excited to partner with the GoSports foundation, who are doing this and more towards athlete development and support.\n\nYesterday, we met a few Olympians and Paralympians, and all of them had a common goal- to make India proud. At Rainmatter by Zerodha we are cheering for them and the team at GoSports Foundation. \n\nDeepthi Bopaiah, Nandan Kamath",
    "url": "https://www.linkedin.com/posts/dilipevs_a-lot-of-good-can-happen-to-india-and-our-activity-7240276643850674176-wi_4?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7235885164088737792",
    "text": "Been 12 months I've been active on social media. Few things are evident. \n\nInstagram: where average people pretend to be millionaires.\nTwitter: where millionaires pretend to be average people.\nLinkedin: where millions of people pretend to be both.",
    "url": "https://www.linkedin.com/posts/dilipevs_been-12-months-ive-been-active-on-social-activity-7235885164088737792-fUFt?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7232971339920252929",
    "text": "Back in the days buying milk was fun. Walk for 20mins to the booth. Exchange currency to get coins. Put each coin in the machine  and wait for the milk. Sometimes do it for others because it gave feelings like playing video games. All the fun is ruined now. Open the door & milk packet is on the doormat. \n\nThis generation might not even know what this feeling was.",
    "url": "https://www.linkedin.com/posts/dilipevs_back-in-the-days-buying-milk-was-fun-walk-activity-7232971339920252929-mrQd?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7232254341938655232",
    "text": "Founders in Mumbai, lets meet! If you are building products to help people stay healthy & fit, I would like to meet you. Rainmatter Health is a venture fund supporting companies making Indians healthy. \n\nThis is the first time we’re doing a meetup in Mumbai. Did one in Delhi few months back and it was super fun.\n\nThis is going to be casual gathering to meet founders, builders and creators building solutions in healthcare. Anything that helps Indians to stay healthy mentally and physically. You could be building in nutrition, health tech, sports or fitness. We could use the time to exchange notes and brainstorm on any problem statement you've in your startup/product. I'll share our thoughts and observations at Rainmatter.\nDate : 28th August. Exact venue will be sent post signup. \n\nRegister here to attend the event : https://lu.ma/alnejly3\n\nIf you know any founder in Mumbai who could come, pls share it with them. \nSee you in Mumbai :)",
    "url": "https://www.linkedin.com/posts/dilipevs_founders-in-mumbai-lets-meet-if-you-are-activity-7232254341938655232-jS9s?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7230804320017899520",
    "text": "Decoding the market for packaged foods in India. And why two IIT grads who went to Harvard and IIM wants to give you better options to eat healthy. \n\nIn this podcast i’m talking to Ahana Gautam founder of Open Secret and Sudarshan Gangrade founder of Bajo Foods.  \n\nThis episode is a business breakdown on building a healthy eating category in India. Everything you should know about creating food products, understanding consumer behaviour, pricing, distribution , surviving and winning an extremely competitive market segment. \n\nSome numbers to give you context :\nPackage food industry in India will be $186 billion market.\nChocolates is $3.8 billion & Snacks is $5.3 billion. \nIs there an opportunity to create healthier alternatives. \n\nCan new startups win consumer adoption in a market that is extremely competitive and has large incumbent players? Why should India eat healthy?\n\nWatch the full episode here https://lnkd.in/gyn6r5BY",
    "url": "https://www.linkedin.com/posts/dilipevs_decoding-the-market-for-packaged-foods-in-activity-7230804882327228416-WI7T?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7226086503972581378",
    "text": "A good coach can change the game. A great coach can change the life. That's Indian Hockey coach Craig Fulton trying to meet his daughter after the win against Great Britain at Olympics yesterday.  \n\nA coach is the anchor to bridge the gap between aspirations and commitment. You don't know what it means to be great unless you have a coach besides you. Everyone needs a coach. At work or playground.",
    "url": "https://www.linkedin.com/posts/dilipevs_a-good-coach-can-change-the-game-a-great-activity-7226086503972581378-x9EU?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7225731343790305280",
    "text": "1.4 billion people and 117 athletes. This podcast is to understand Indian sports, governance & infrastructure. And how do we bridge the gap between potential and commitment to olympic aspirations.\n\nI’m talking Deepthi Bopaiah, CEO of GoSports Foundation. She has spent many years in identifying and supporting talent for Indian sports.\nThis episode will tell you more about\n-Sports governance  in India and how it works.\n-Current infrastructure and what could be done to improve.\n-Stories about women and parathletes in Indian sports you never knew.\n-Toolkits for young athletes and their parents to pursue sports as professional career.\n-And how we can create better systems to have more olympic medal potentials.\n\nWatch the full podcast here https://lnkd.in/gYKVSwnJ\n\nDo me a favour and please share it with an aspiring athlete or a parent who has dreams to make a kid play sports for India.",
    "url": "https://www.linkedin.com/posts/dilipevs_14-billion-people-and-117-athletes-this-activity-7225731609134522368-JiE6?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7225004732379979777",
    "text": "Employee health & fitness shouldn’t be complicated. It should be simple and it should be a culture.\n\nWe had a random internal chat on world record for push-ups. And decided to check how many we can do in a minute. This is a video from that 😊\n\nNo HR was involved. There was no cash prize, no incentives, no leaderboard. No one was forced but most chose to do.\n\nEmployee health shouldn’t be limited to one yoga day or world health day. It should be a regular conversation. It should be driven by everyone from top to bottom. Don’t over engineer it with too many wellness programs. Keep it simple. Make it a culture. \n\nZerodha | Rainmatter by Zerodha",
    "url": "https://www.linkedin.com/posts/dilipevs_employee-health-fitness-shouldnt-be-complicated-activity-7225004743327113216-dbOi?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7221742252937633792",
    "text": "Everytime you hear this crap, women shouldn’t lift weights. Ignore & just remember these women. \n\nThese are Olympic and World champions 🇮🇳. Because they lift weights. \n\nNext time you see a woman walk into a gym, cheer for her. Offer her help. She will feel confident. She will come back again.\n\nNo one has ever said, I don’t want to feel strong.",
    "url": "https://www.linkedin.com/posts/dilipevs_everytime-you-hear-this-crap-women-shouldn-activity-7221742252937633792--rZ6?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7221012947748208643",
    "text": "Cricket should support other sports in India. I wrote about this two weeks ago. Some supported and others critiqued. \n\nYesterday BCCI announced a 8.5cr support to Indian athletes going to Paris olympics.\n\nThis was the original tweet that went viral https://lnkd.in/gU4JFxr9\n\nMost people are afraid of sharing their thoughts online. One of the biggest mistake is that people think they have to be an \"expert\" to share about something. \nI'm telling you, the power of speaking your mind is underrated. \n\nAppreciate the gesture by Board of Control for Cricket in India (BCCI).\n\nHope more will come out to support Indian sports.",
    "url": "https://www.linkedin.com/posts/dilipevs_cricket-should-support-other-sports-in-india-activity-7221012947748208643-X4Lp?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7212311569286746112",
    "text": "AI & ChatGPT will not solve for this. You have to. Becoming unfit is not an event. It is a process.\n\n-Prioritise physical activity. Nothing is more important.\n-Eat healthy. Don’t be the profit machine to processed & packaged industry.\n\nYour only goal should be to be in your kids & partners life as long as you can.\n\nLike loosing money, loosing your health is rarely caused by one thing going wrong. Usually, it is a series of ignorance and wrong doings. Take control now.\n\nIf you wait until you're motivated, you’ve already lost.",
    "url": "https://www.linkedin.com/posts/dilipevs_ai-chatgpt-will-not-solve-for-this-you-activity-7212311569286746112-hqX6?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7210866833644564480",
    "text": "Bring a bunch of founders under one roof, let them talk to each other, give no gyaan. And magic will happen. Last Friday was this. \nDid an impromptu Health Founders meet-up in Delhi last Friday. 180+ people signed up. Could only admit 40 due to space limitations. All of them showed up and few brought their co-founders along.\n\nI thought events and meet-ups were in abundance. Maybe 5-10 people will turn up. But 50 founders were hanging out for 4 hrs on a Friday evening. And all passionate about health and building products to make Indians healthy. \n\nThere was no speech, no panel, no agenda. \nBut entrepreneurs have an innate ability to communicate. So they all started talking to each other. Figured that networking is overrated. But a space to have unfiltered conversations and be your authentic is underrated. \n\nSome got new customers.\nSome met their customers who were using their products. \nSome got offer to share the office space.\nSome validated their new product ideas.\nSome established new partnerships. \nLot of questions on why, what and how. \nAnd a few made their funding pitch. Founder preamble you know :) \nThere was learning and a some unlearning. \n\nApologies for people we couldn’t admit. There was a genuine space limitation. \nIt was an experiment and i dint expect this much response. \n\nAt Rainmatter our credo is to add meaningful support to the ecosystem. \nEither through capital allocation or cheering for entrepreneurs. \nShould we do this more often? In other cities?",
    "url": "https://www.linkedin.com/posts/dilipevs_bring-a-bunch-of-founders-under-one-roof-activity-7210866833644564480-QWmF?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7201805723964514304",
    "text": "Behind every star athlete or a champion there is a supporting family. \nParents who teach their kids that success is not about winning but how well they can recover when they fall. \n\nThis is Nagalakshmi. An unassuming mother of two young Indian chess prodigies Praggnanandhaa and Vaishali. The first-ever brother-sister duo to both earn the Grand master title. Today both of them are well known for their achievements in the sport. Most don’t know that their mother, Nagalakshmi accompanies them to tournaments for encouragement and support. Father Rameshbabu works as a branch manager at TNSC Bank and is honest to say they were facing financial constraints but were determined to support both their kids. \n\nI’ve now spent time with Olympians, World champions & India no.1 on my podcast and a common thread amongst all of them is their early childhood and the parental support all of them had.  The most important economic decisions a society makes are not made in corporate offices, but in homes.\nhttps://x.com/kmr_dilip",
    "url": "https://www.linkedin.com/posts/dilipevs_behind-every-star-athlete-or-a-champion-there-activity-7201805723964514304-ojcg?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7185511912204316672",
    "text": "Have met 500+ startups solving for health, nutrition & fitness in last 12 months at Rainmatter. There is an opportunity no one is looking at. My thoughts....\n\nThose building tech mostly tell HOW is the sleep, blood glucose , calories, HRV , recovery and more. Your current baseline. That's the current generation of wearables. \n\nBut no is telling WHY it's happening. \nI think this will be the future of health wearables. \n\nThose building food products claim THEY are healthy & better. \nBut no one is telling WHY they are better.\n\nI think solving for WHY will unlock new market opportunities . \nHow & What will get you first time customer. \nWhy will get you lifetime user.\n\nUsecase: If the RHR (resting heart rate) suddenly spikes, we should know why.\nIf the HRV dropped, we should know what caused it.\n\nShared some other opportunities earlier here https://lnkd.in/gn6ibaGj",
    "url": "https://www.linkedin.com/posts/dilipevs_have-met-500-startups-solving-for-health-activity-7185511912204316672-Vrfu?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGC0ANEB8TpzHIxGJlVGo2iJthOS_mZ_AUs",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7180065826794868736",
    "text": "Doing a podcast with Narain Karthikeyan next week. What should I ask him? This is his first podcast ever.",
    "url": "https://www.linkedin.com/posts/dilipevs_doing-a-podcast-with-narain-karthikeyan-next-activity-7180065826794868736-sIqG?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7179343508334391297",
    "text": "Failures, medals, Olympics.  \nAnd the journey to become India number 1. \n\n\nIn this podcast I’m having a conversation with Prannoy HS . He is an Arjuna award winner currently ranked number 1 player in Badminton singles in India. And will represent the country in 2024 Olympics. \n\nBut his journey has been a roller coaster with injuries and failures. And the comeback to winning medals is a fascinating tale of grit & determination. He has been one of the architects for winning the Thomas cup & Commonwealth games gold medal. \n\nIn this podcast we discussed \n- Early years in Badminton and the pursuit to become a champion player \n- How parents can play a role in creating future olympians. \n- Coaching with Gopichand and career winning moments\n- How professional athletes train and manage life.\n- Managing stress & mental health.\n- Building sports culture in India\n- Failures and lessons from it\n- And more \n\nLinks to the full podcast\n\nYoutube: https://lnkd.in/g5_kC2rK\n\nSpotify: https://lnkd.in/g-KUy5cy\n\nApple podcast: https://lnkd.in/gKG4tiP3",
    "url": "https://www.linkedin.com/posts/dilipevs_failures-medals-olympics-and-the-journey-activity-7179343532061519872-U0tT?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7176472734330228737",
    "text": "Can you make people healthy & fit and make a business out of it? Yes, you can. \n\nIn this podcast, I’m talking to Jitendra Chouksey, founder of FITTR. \nI’ve known JC as a health educator. But he is also an entrepreneur building a community and coach led fitness education platform.\n\nIn our conversation, we discuss:\n🔸The making of the accidental entrepreneur \n🔸 Breakdown of the fitness market in India \n🔸 Building products and features that drive outcomes \n🔸 Lessons from building a community driven platform\n🔸 Toolkit for mental health.\n🔸 Failures, and stories of personal growth\n🔸 How to design your now operating system for health with specifics on nutrition and exercise.\n🔸 Much more\nThis was a long conversation and i hope you find it useful.\n\nListen now 👇\n\nYouTube: https://lnkd.in/gfpaCriv\n\nSpotify: https://lnkd.in/gfGWfHg5\n\nApple: https://lnkd.in/gQ_m-8V3",
    "url": "https://www.linkedin.com/posts/dilipevs_can-you-make-people-healthy-fit-and-make-activity-7176473825960767490-EwA0?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7175723731808309248",
    "text": "An unpopular opinion about founders/VC's building and investing in health category. This may disappoint a few.\n\nFirst, if you are a founder building in the health. You've to walk the talk. \nWhat does that mean? You have to be healthy and fit. \n\n-The biggest moat in the health industry is trust. This can't be built by performance marketing or hiring influencers. \n-Why will a customer trust your product if the founder isn't healthy? You don't need six packs. But you shouldn't look unfit.\n-If your product came out from your own problem statement, great. Tell the world how you got there and share your experience. \n-In health industry you scale by not selling features. But by earning the trust. \n\nSecond, don't pitch or raise money from an investor who doesn't walk the talk. \n\n-To build a scalable business TAM is important. But impact is most important.\n- If the first question they ask is, how large is the business and not why you choose to build the product. That's a sign.\n- If an investor doesn't make an effort to experience your product or service and offer genuine feedback. They are truly not investing in you. But chasing vanity.\n- Have seen many VC events ending with alcohol and the food corner filled with junk. And that happens because they don't walk the talk and perhaps staying healthy is not their top priority in personal life. \n\nThat's it. Hope this changes. And we build businesses and products that brings impact on people. And trust is your anchor to scale.",
    "url": "https://www.linkedin.com/posts/dilipevs_an-unpopular-opinion-about-foundersvcs-activity-7175723731808309248-nc1r?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7173545853926797312",
    "text": "32000 people have added \"Career Break\" and 53000 added \"Sabbatical\" as their current position on Linkedin. \n\nMost common description is \" Working on my health & fitness\" \nHow did we get here?",
    "url": "https://www.linkedin.com/posts/dilipevs_32000-people-have-added-career-break-and-activity-7173545853926797312-ICrt?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7170657050065035264",
    "text": "Being vulnerable is not a weakness. \nIt can be a strength. \nA must read if you are confused, lost or want to pause. I’ve been there. \n\n\nTLDR from the post. \n\n1. Money past a certain point won't make you happier, in fact it will make you feel lonlier\n\n2. Find your values, what makes you tick\n\n3. Fuck it, just start and fail. There are lessons everywhere.",
    "url": "https://www.linkedin.com/posts/dilipevs_being-vulnerable-is-not-a-weakness-it-can-activity-7170657053089128448--J5Z?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7164480407277592577",
    "text": "73% of Indians are deficient in protein & over 80% of the population does not meet their daily protein requirements. There is a $2billion market opportunity in dietary supplements in India.\n\nSo do people really need supplements? Who is buying and why?\n\nI sat down with three entrepreneurs building products and brands in this space -Samit Gupta of Neulife Nutrition , Pranav Malhotra of Trunativ & Shashank Mehta of TheWholeTruth. \n\nWe discussed what it takes to build a business in nutrition category, how do consumers know what is genuine and fake, setting manufacturing, R&D capabilities, pricing , sourcing and growth opportunities in health foods and more.\n\nIf you are an enthusiast of consumer products or keen to build for the health market, this episode will have many takeaways for you.\n\nLinks to full podcast\nYoutube: https://lnkd.in/gyPGxaYP\nSpotify: https://lnkd.in/gDrjHCyp\nApple: https://lnkd.in/gC8CERqG",
    "url": "https://www.linkedin.com/posts/dilipevs_73-of-indians-are-deficient-in-protein-activity-7164480575385391104-Kyd6?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7161581465128960001",
    "text": "A good coach can change the game. A great coach can change the life. \n\n\nI met Prannoy HS last week and we did a podcast together. \n\nOne topic we discussed a lot was about coaching. It’s a tool that many people don’t use much. Wether you are an athelete, entrepreneur, working professional or just anyone who wants to find the best in you. You need a coach. \n\nYou don't know what it means to be great unless you have a coach besides you. \n\nPrannoy & Gopi has a special relationship that is beyond Badminton. I’m glad we sat down to unpack this and more. \n\nMy takeway- The progress in your goal is the gap between your desire and commitment. The coach is your tool to measure it meaningfully.",
    "url": "https://www.linkedin.com/posts/dilipevs_a-good-coach-can-change-the-game-a-great-activity-7161581465128960001-MRfH?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7158667897081364481",
    "text": "Because some people admire Hrithik Roshan. So listen up!\n\n\nBecoming unhealthy is not an event. It is a process.\nLike loosing money, loosing your health is rarely caused by one thing going wrong. Usually, it is a series of ignorance and wrong doings. \nTake control now.",
    "url": "https://www.linkedin.com/posts/dilipevs_because-some-people-admire-hrithik-roshan-activity-7158667965503057920-NZN3?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7156509721816887297",
    "text": "20+ years in sports. Oldest player in the history of tennis to be World rank 1. \nThis is a special podcast with Rohan Bopanna. \n\n\nI sat down with Rohan just few days before he left for Australian Open. This conversation is not just for sports enthusiasts but for anyone who wants to get peak performance in life.\n\nRohan is redefining sports with his perseverance, consistency and mental strength. In his own words that's his toolkit to success. He is 43 year old and competing and winning at this elite level has never been done in the history of the sport. \n\nFull podcast on\nYoutube: https://lnkd.in/giNUCu59\nSpotify: https://lnkd.in/g9Tmu987\nApple: https://lnkd.in/gbhWiTUT\n\nWe discussed mental models for peak performance in life, how he overcame failures and setbacks, managing stress, his mental & physical training routine, support system we need build a sporting culture in India, parenthood and much more. \n\nIt's a 2 hr long conversation like most of my podcasts 😊.  So give time to learn and absorb from one of the great athlete of all time. \n\nDo share your feedback.",
    "url": "https://www.linkedin.com/posts/dilipevs_20-years-in-sports-oldest-player-in-the-activity-7156510281718792193-ajaZ?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7150397503887040513",
    "text": "Founders, never let the investors be the judge of your passion and commitment.\n\n\nMissing good investments is the occupational hazard of venture capitalists.\nOne of the biggest learning in the past year after talking to 200+ founders is , investors can never estimate the insight a founder has to the problem statement they are solving for. A phone call or a coffee meeting will never be enough. \n\nFounder's superpower is the ability to understand user problems and build solutions that customers may not even ask for. And investors should let curiosity anchor the conversations than making conclusions based on reports or industry thesis. You may still not get it. That's fine. When you're a VC, not all bets are winners – some are just lessons.\n\nBtw, the market cap for Tesla today is $753 billion :) \nThis excerpt is from Bessemer Venture Partner anti portfolio page.",
    "url": "https://www.linkedin.com/posts/dilipevs_founders-never-let-the-investors-be-the-activity-7150397503887040513-bvXI?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7147467005774684162",
    "text": "First day of the year. \nSet goals & expectations that you can carry. \n\nHappy New Year!",
    "url": "https://www.linkedin.com/posts/dilipevs_first-day-of-the-year-set-goals-expectations-activity-7147467005774684162-bQLV?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7140931872661962753",
    "text": "Charlie Munger on India\n\n“You can't find any two groups on Earth that are more interested in getting ahead than the people in India and China.”\n\n\" I'm way more popular in India and China than I am in my own country. And I don't mind that either. I think it's peculiar that these high-IQ nerds in China and India love me, and my own country, people think I'm a pompous old bastard\"\n\nExcerpts from a recent conversation Charlie had with John Collison & Patrick O'Shaughnessy, https://lnkd.in/dN3x9-tp\n\nThank you Charlie! ❤️ \nLets get back to building things.",
    "url": "https://www.linkedin.com/posts/dilipevs_charlie-munger-on-india-you-cant-find-activity-7140931872661962753-ozKU?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7138038307703160835",
    "text": "23 million girls in India drop out of school annually due to a lack of proper menstrual hygiene facilities.\n\nMore than 300 million women in India still don't have access to proper menstrual hygiene products. And still use old rags, ash, leaves & clothes. \n\nWas talking to Vikas Bagaria yesterday to understand the current situation. \n\nWhile brands will do their bit to build awareness. The biggest impact will happen when we start talking about it at home, office and in social circles. \n\n-Celebrating one women's day in a year doesn't do any good. \n-Men should be comfortable in breaking the silence and engage in conversations with their daughter, sister, spouse & friends. \n-Menstruation education should be everyone's business. Awareness amongst girl child is good. But should be equally important amongst young boys. \n\nIgnorance is the real taboo. Menstruation education is a collective responsibility. \nThis video came up later internally and thought it's apt to share here.",
    "url": "https://www.linkedin.com/posts/dilipevs_23-million-girls-in-india-drop-out-of-school-activity-7138038451756560386-pudQ?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7134041604511715329",
    "text": "Employee wellness needn’t be complicated. \n\nThat’s Nithin, Vishnu & me crossing the finish line at IronMan Goa last month.\nWe participated as a corporate relay team. \n\nWorking in a 9am-6pm work environment can be stressful. Be it corporates or startups. Employers want their teams to be healthy. And employees want to live a healthy life. \nThe mismatch is in expectations.\n\nMost employers over complicate employee wellness by pushing for programs that don't sync with everyone. But sometimes the biggest impact is driven by doing simple things. \n\nAt Zerodha & Rainmatter playing sports is an anchor that has worked well.\nNot just evangelising it but participation from top leadership to everyone in the company. \n\nFor those interested how we do this internally. This is a link to the forum where we discussed everything from event planning, creating a team, training and more. We had three teams and everyone met each other only at the event :) \n\nLink: https://lnkd.in/giV8PgBA\n\nThe upside is, now we have more folks doing events for running, triathlons, obstacle racing and more. There are groups playing some sport every weekend. And all this without any complicated employee wellness program. \nPeople just talk to each other, signup events and show up to the start line. \n\nBecoming a healthy company is not an event.\nIt's a process.",
    "url": "https://www.linkedin.com/posts/dilipevs_employee-wellness-neednt-be-complicated-activity-7134041604511715329-BylK?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7133335498831380482",
    "text": "From a small town girl to becoming India's fitness evangelist. \nAn entrepreneur, a mother and a lifelong fitness enthusiast.\n\nExploring The Other Side of Shwetambari Shetty in the latest episode of the podcast. \nLinks to the full podcast: \nYoutube : https://lnkd.in/gANvd7XK\nSpotify: https://lnkd.in/gXRjupka\nApple podcast : https://lnkd.in/gTY4yxmr\n\nWe discussed a range of topics from\n-Fitness landscape of women in India. \n-Lessons from training 10000+ women in India. \n-Women entrepreneurship. \n-Her startup exit to Curefit - house of cult\n- Becoming a parent at 40 and continuing to stay fit. \n-Parenting kids to live a healthy life.\n-The balancing act of a parent & entrepreneur. \n\nI hope you get out and start exploring your own other side soon.\n\nIf you're new to the podcast, you can find all the past video episodes here https://lnkd.in/gxHbvfJd",
    "url": "https://www.linkedin.com/posts/dilipevs_from-a-small-town-girl-to-becoming-indias-activity-7133336443883552769-cOEQ?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7128254302426451968",
    "text": "Women who play sports are underrated.\nWomen who do startups are underrated. \nBut doing both is a superpower. \n\nIn the latest podcast series of Startups building for health by Rainmatter, I'm talking to Jayanti Bhattacharya Co-founder of India Hemp and Co. An entrepreneur and an athlete.\n\nWe discussed the landscape of alternative proteins in India, building products for a new category, market opportunity of hemp for nutrition, balancing act of an entrepreneur and parent , toolkit to traverse through a regulated market and reimagining a new identity through fitness and kicking some balls ⚽ 😊 \n\nListen & watch to the full episode on \nYoutube: https://lnkd.in/gbMbR5qG\nSpotify: https://lnkd.in/gSb5CBzW\nApple podcast: https://lnkd.in/gdpa9sU8\n\n#entrepreneurship #startups #health #fitness #womeninbusiness #womenentrepreneurs",
    "url": "https://www.linkedin.com/posts/dilipevs_entrepreneurship-startups-health-activity-7128254629846413312-Agvu?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7117015330635268096",
    "text": "Health startups in India 🇮🇳\n\nLast week i shared the first set of names https://lnkd.in/eq4iv_Rm\n\nWhy? Because at Rainmatter Health, we meet many founders and startups.\nWe may invest only in a few but each one has a reason to exist. And more people should know about the work they do.\n\nEvery Monday I will share names of founders and their startups we have met. Here is another set of companies.\n\nGoSports Foundation  Foundation - A non-profit organisation providing support to talented and emerging athletes. More support means more medals for the country.\nFounders Nandan Kamath ,Roshan Gopalakrishna  \n\nRevergon Solutions  Building solutions for MSK related pain and disorders.\nFounder APURVA DANGI\n\nRetü Foods nutrition for restorative health.\nFounders Lavindra , Dr Ritu Chhatwal\n\nBonatra  Using data science and technology to manage and reverse chronic diseases.\nFounders Rahul Kishore Singh Ramanpreet Singh Arora  Amit Acharya \n\nSugar Watchers  Making low Glycemic Index (GI) food available to everyone.\nFounders Treman Singh Ahluwalia   Ananya Raniwala  Karan Jain\n\nFloryo  Making fresh staple foods available to everyone.\nFounder Manohar Kumar\n\nSocialBoat - Women Health-  Helping women manage chronic menstrual issues. \nFounders Swapnil Vats , Rahul jain\n\nUmrit - Solving for personalised health and longevity using data and science across different vectors of nutrition, sleep and exercise.\nFounders Subhendu Panigrahi , Yashodhara Satpathy \n\nHappy Ratio  QSR for healthy meals.\nFounder Harsh Batra \n\nfuro.fit  A social platform for health and wellness making corporates a healtheir workplace.\nFounders Abhishek Roy  Ashrith G \n\nResolute (HumanFractal.Ai) An integrated health platform that gives deep insights on blood tests and creates customised feedback loop.\nFounders Vikas G., Srinivasa Vivek Jothiprakasam\n\nmyUpchar.com digital health clinic for Indians in Tier2/3 cities\nFounder Rajat Garg\n\nPee Safe  Making products for women's personal hygiene and more.\nFounders Srijana Bagaria , Vikas Bagaria , Rithish Kumar  \nDisclosure: We are an investor in PeeSafe :)\n\nIf you've tried these products or solutions, do share the feedback to the founders.",
    "url": "https://www.linkedin.com/posts/dilipevs_%E0%A4%AD%E0%A4%B0%E0%A4%A4-%E0%A4%95-%E0%A4%B8%E0%A4%AC%E0%A4%B8-%E0%A4%AC%E0%A5%9C-%E0%A4%B9%E0%A4%B2%E0%A4%A5-%E0%A4%B8%E0%A4%88%E0%A4%9F-indias-1-activity-7117015330635268096-ZHAo?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7103281575559106560",
    "text": "600 gold medals 🥇 . Olympian. Now an entrepreneur. \n\nThis is a fascinating conversation of how a young girl who dreaded swimming went on to win 600+ gold medals and represented India in Olympics.\n\nIn this podcast, I’m talking to Nisha Millet. An Arjuna award winner, she has won numerous domestic & international events. Was the only woman in the 2000 olympics swim team from India. Now a mother of two and an entrepreneur. \n\nIn this podcast we discussed:\n- How parents can play a role in creating future olympians.\n- The importance of sports & fitness in the personal development of a child. \n- How professional athletes train and manage life. \n- Her comeback and challenges post retirement from professional swimming.  \n- Overcoming mental health challenges. \n- Journey from an athlete to an entrepreneur.\n- The thin line between parental , societal expectations and own self. \n- Regaining her lost fitness post child birth. What worked and dint. \n- Her current training routine to be an endurance runner and CrossFit athlete.\n\nThere are a lot to takeways from this conversation and I hope this is useful to you. \n\nLinks to the full podcast\nYoutube : https://lnkd.in/gZK-KSWA\nSpotify: https://lnkd.in/gYJPct9w\nApple podcast : https://lnkd.in/gC6pW4Gg\n\nIf you are new to the podcast, you can find all the past video episodes here https://lnkd.in/gxHbvfJd",
    "url": "https://www.linkedin.com/posts/dilipevs_600-gold-medals-olympian-now-an-entrepreneur-activity-7103315564520996864-RSIv?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7100026469761896449",
    "text": "Startups building for health X Rainmatter\n\nThis is a new podcast series to explore conversations with startups and their founders reimagining the business of health, fitness & nutrition.\n\nIndia has massive health problems. Physical & mental health , nutrition and more. Lifestyles diseases have collectively affected over 400 million Indians across age groups. And we need entrepreneurs to solve for these problems. Not one but many should attempt.\n\nIn this series, the conversations will be to explore what these entrepreneurs are building and why it's important. \n\nIn the first episode, i'm joined by Adnan Adeeb, Co-founder of Spectacom Global. The company behind Devils Circuit, Bunkerfit and GetmyBIB.\nListen to the full episode on \nYoutube: https://lnkd.in/gSuMSs3b\nSpotify: https://lnkd.in/gNxwDYGu\nApple podcast: https://lnkd.in/gFnHQVSB\n\nAdnan and Zeba are building an ecosystem of fitness and sporting assets to make staying fit fun and exciting for people of all age groups.\n\nWe discuss the founding story , how they got the first 100 participants for their first race, the near closure of the company and how the team revived and scaled back post pandemic, the unknowns of sports business in India, transition from a physical experience product to a platform company. And the new stuff they are building to redefinine fitness entertainment.\n\nIf you participate in any of the Devil Circuit race, the war cry #booyah will reverberate in your head for next few days 😊 \n\nHope you enjoy the episode.\n\nIf you have any questions or feedback for Adnan and Zeba, drop a comment below and they will respond.",
    "url": "https://www.linkedin.com/posts/dilipevs_booyah-activity-7100053596188114944-Gk15?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7097897969718366208",
    "text": "Founder depression is a common reality among entrepreneurs of all stripes.\nNever show weakness and be the cheerleader in tough situations is over celebrated. \n\nReality is founders are 30% more likely to experience depression than others. \nhttps://lnkd.in/gdJF7Wz5\n\nRecent studies put the number of founders with some form of mental health issue at 49%\n\nIt’s important to normalize mental health issues in startups.\n\nRaghunandan has been a tremendous help to me when I was building and remains a trusted advisor and friend to many entrepreneurs.\n\nIf you are founder, go find your Raghu 😊\n\nWe discuss tools for mental health for founders in detail on the podcast \n\nYoutube : https://lnkd.in/gthmks2x\nSpotify: https://lnkd.in/gQjBJ7Uv\nApple podcast : https://lnkd.in/gmw5YUfz",
    "url": "https://www.linkedin.com/posts/dilipevs_founder-depression-is-a-common-reality-among-activity-7097897984314511360-u-Ro?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7097086756893687808",
    "text": "As long i live, i will play and win”\n\nThat’s Bhagwani Devi. \nA 95-year-old athlete from Delhi ✨ \n\nShe won three gold medals for India at the World Masters Athletics Indoor Championships at Poland. 🥇 \n\nNot just in one sports. But three different sports- 60mtr running, shot put and discus throw.\n\nAfter the championship she said “As long i live, i will play and win”\n\nShe was not an athlete in her younger days. \nHad hardships all through her growing years. \nLost husband & one son in her 30’s. \nWorked at farm to earn a living.\n\nStarted playing sports at the young age of 94 encouraged by her grandson Vikas Dagar—a national para-athlete.\n\nTraining at this age is not easy. But she now has a competent team that manages all aspects of her strength, nutrition & fitness.\n\nSport is a great way to stay healthy. \nFind what is fun to you. \nMakes you move. \nAnd you enjoy the most. \n\nBhagwani Devi found the athlete in her in 90’s.\nI found mine in my mid 30’s. \nGood luck to finding the athlete in you!",
    "url": "https://www.linkedin.com/posts/dilipevs_as-long-i-live-i-will-play-and-win-that-activity-7097086756893687808-Ab6F?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7093513909466263552",
    "text": "Everyone has a reason to race.\nWe all need to find that reason.\nAt work or on the field.\n\nA few years after the death of her husband, Marjorie was inspired to run her first marathon. After seven months of training, this 81-year-old ran in the NYC Marathon as a dedication to her husband.\n\nShe trained for it.\nAt an age, when most will write her off.\n\nThe marathon doesn't owe you anything.\nWhen you run a marathon, you run against your own fears.\nNot against the other runners.",
    "url": "https://www.linkedin.com/posts/dilipevs_everyone-has-a-reason-to-race-we-all-need-activity-7093513963023306752-DlQx?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7087734725133422593",
    "text": "Every step counts \n\nThe choice you make is the gap between your desire & commitment.\n\n Zerodha & Rainmatter getting the basics right.",
    "url": "https://www.linkedin.com/posts/dilipevs_every-step-counts-the-choice-you-make-is-activity-7087734725133422593-7E6i?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7087318752261779456",
    "text": "Mother of Two. An Ultramarathoner.\nAnd perhaps the fastest CFO in India.\n\nIn this eighth episode of \"The Other Side\", I'm talking with Rashmi Mohanty who is currently the CFO of SBI Card. An endurance athlete who runs 100km races to explore her mental & physical limits.\n\nIn this podcast we unpack her other side:\n- Her journey from a college athlete to corporate boardroom.\n- Revisiting her passion for sports & fitness after becoming a mother of two toddlers.\n- Chasing peak athletic pursuits in her 50's.\n- Balancing training between family & professional commitments.\n- Experiences of running some of the toughest races in the world.\n- Toolkit to overcome challenges faced by women in corporate & sports.\n\nThere are a lot of takeways from this conversation and I hope it inspires you to get out and start building your other side soon\n\nLinks to the full podcast:\nYoutube : https://lnkd.in/g3GWp6CP\nSpotify: https://lnkd.in/gpsvEW7f\nApple : https://lnkd.in/gctriuMP\n\nIf you're new to the podcast, you can find all the past video episodes here https://lnkd.in/gxHbvfJd\n\n#fitness #fitmom #womeninsports #womeninbusiness #marathon #womenhealth",
    "url": "https://www.linkedin.com/posts/dilipevs_fitness-fitmom-womeninsports-activity-7087319241820966912-Rm-8?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7084048363146416128",
    "text": "Admire them. But don't get influenced.\nYou know they don't eat any of it. Right?\n\nTell your kids too.\nThey may be surprised. \nBut they should know this too.\n\nNot entirely the fault of athletes. \nMaybe some bit.\nGood marketing is influencing the gullible.\n\nNow you know it.\n\nThere is no proxy to regular whole foods.",
    "url": "https://www.linkedin.com/posts/dilipevs_admire-them-but-dont-get-influenced-you-activity-7084048363146416128-d4rG?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7077558582514233344",
    "text": "Doing a podcast this weekend with Dr. Abby Philips also known as TheLiverDoc on Twitter. https://lnkd.in/gHqX2jQD \n\nWhat would you like me to ask him? Suggestions on questions and topics?\n\nMy idea is to explore what is right & wrong about health that we see and read daily. And maybe establish some tools that everyone can use to create their own health protocols.",
    "url": "https://www.linkedin.com/posts/dilipevs_doing-a-podcast-this-weekend-with-dr-abby-activity-7077558582514233344--Sb7?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGEsG0ABFmlmZye_QBC9XS6e4FtMFn7apC0",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7072800005954134016",
    "text": "AI & ChatGPT may not solve for this.\nYou have to.\n\nBecoming unhealthy is not an event. \nIt is a process.\n\n❎ 11.4% Indians are diabetic. \n❎ 35.5% Indians suffer from hypertension. \n❎ 28.6% Indians have generalised obesity.\n❎ The rates of childhood obesity in our country should be a national emergency.\n\nUnpopular opinion. One out of five here might be one of this. \n\nWhat can you do?\n1. Prioritise physical activity. Nothing is more important. \n2. Eat healthy. Don’t be the profit machine to processed & packaged food industry. \n\nYour only goal should be to be in your kids & partners life as long as you can. \n\nIf you wait until you're motivated, you’ve already lost.\n\nSource: https://lnkd.in/e7CeibeE",
    "url": "https://www.linkedin.com/posts/dilipevs_ai-chatgpt-may-not-solve-for-this-you-activity-7072800005954134016-6bXI?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7064905540245622784",
    "text": "GOALS\nThey look far and hazy unless you keep chasing them. \nEvery day, every week, every month.\n\n\nIn 2020, I set a goal to run a Sub 3hr marathon. \nFor 4months, I was chasing this goal. It was up on my wall 😊 \nTo become Sub 3 marathoner.\n\nAnd every week, I got two inch closer.\n\nI’ll wake up and stare at the wall reminiscing all the past training and before going to bed muster whatever left for the next day.\n\nMarathon training is just learning to be bored while you're hurting. \n\nDid i meet my goal? ...Yes, I finished 2:59:52 😌 \nBut those 16 weeks changed me a lot.\nas an entrepreneur,\nas a colleague,\nas a husband,\nas a friend,\nand as an athlete.\n\nThere are maybe 100 men in India who can run Sub3hr marathon.\nI'm one of them.\nToday a 2:55:58 Marathoner.\nHead high, heart full.\n\nEveryone teaches motivation. But no one learns discipline.\nMotivation is in abundance. Discipline is scarce. \n\nThe progress in your goals is the gap between your desire and commitment. \n\nThis is the exact training plan i followed to become a Sub3hr marathoner 😊 👇 \n\n\nI host a podcast called  \"The Other Side” \nVideo https://lnkd.in/gxHbvfJd\nAudio https://pod.link/dilip",
    "url": "https://www.linkedin.com/posts/dilipevs_goals-activity-7064905541000589312-vQSa?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7059097875628097537",
    "text": "Entrepreneurs playing valuations & talking funding are overrated.\nEntrepreneurs playing sports & talking health are underrated. \n\nDo you know any of these underrated folks?\n\nFew folks I know who walk the talk. \nVineeta Singh \nJayanti Bhattacharya \nNithin Kamath \nRishi Vasudev \nAdnan Adeeb \nGauravjeet Singh \nAbhishek Roy \nNirupa Shankar \nLizzie Chapman \nRaghunandan G \nAditya Ghosh \nEd Baker \nVijayaraghavan Venugopal \n\nI host a podcast- The Other Side, exploring the mental & physical routines of entrepreneurs. Unpacking things that makes them unique. \n\nTag the founders in comments you think I should get on the podcast. \n\nLink to the podcast https://lnkd.in/gxHbvfJd",
    "url": "https://www.linkedin.com/posts/dilipevs_entrepreneurs-playing-valuations-talking-activity-7059097875628097537-m9ji?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7057521621883916288",
    "text": "50 marathons & 20 years of running.\nThat's the other side of Pankaj Rai (He/Him/His)\n\nThis is the fifth episode of my podcast The Other Side. \nIt's been a while and i will be regular going forward 😊\n\nMy guest for this episode is Pankaj Rai. He is Chief Data & Analytics officer at Aditya Birla Group. And has worked with many large corporations at senior leadership positions.\n\nIn this podcast we unpack the other side which most don't know about him.\n- How running helps him to connect with people.\n- Physical training routines that guides him to run 2-3 marathons every year.\n- His toolkit for mental health\n- The secret behind him finishing 3hr 45 mins at Tata Mumbai marathon 2023 at age 50+ 😀\nAnd much more...\n\nI hope this conversation inspires you to get out and start building your own other side soon.\n\nLinks to the full podcast\n\nYoutube : https://lnkd.in/gspQ5wvJ\nSpotify:https://lnkd.in/gfB3Vp6H\nApple podcast : https://lnkd.in/grP97p6V\n\nIf you're new to the podcast, you can find all the past video episodes here\nhttps://lnkd.in/gxHbvfJd",
    "url": "https://www.linkedin.com/posts/dilipevs_50-marathons-20-years-of-running-thats-activity-7057601834214977536-R38D?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7051078819134259200",
    "text": "Can you find anything healthy inside?\n\nThe global packaged food industry is valued at $1.08 trillion.\nNow you know why. \n\nYour body is your business. \n\nYou can create a health monopoly when packaged & processed food companies can’t make profit from you.\n\nPic source : unknown",
    "url": "https://www.linkedin.com/posts/dilipevs_can-you-find-anything-healthy-inside-the-activity-7051078819134259200-Gj_c?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:7049963682197360640",
    "text": "“As long i live, i will play and win”\n\nThat’s Bhagwani Devi. \nA 95-year-old athlete from Delhi ✨ \n\nShe won three gold medals for India at the World Masters Athletics Indoor Championships at Poland. 🥇 \n\nNot just in one sports. But three different sports- 60mtr running, shot put and discus throw.\n\nAfter the championship she said “As long i live, i will play and win”\n\nShe was not an athlete in her younger days. \nHad hardships all through her growing years. \nLost husband & one son in her 30’s. \nWorked at farm to earn a living.\n\nStarted playing sports at the young age of 94 encouraged by her grandson Vikas Dagar—a national para-athlete.\n\nTraining at this age is not easy. But she now has a competent team that manages all aspects of her strength, nutrition & fitness.\n\nSport is a great way to stay healthy. \nFind what is fun to you. \nMakes you move. \nAnd you enjoy the most. \n\nBhagwani Devi found the athlete in her in early 90’s.\nI found mine in my mid 30’s. \nGood luck to finding the athlete in you!",
    "url": "https://www.linkedin.com/posts/dilipevs_as-long-i-live-i-will-play-and-win-that-activity-7049963682197360640-rdpi?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7027589729277657088",
    "text": "Priyanka Gupta asked me why the heck i'm so keen to prioritise fitness. And it took 60 mins to explain the \"Why\". \n\nI hope our conversation is useful in some way. \n\nPlease remember, becoming unhealthy is not an event. It is a process. Like a plane crash, becoming unhealthy is rarely caused by one thing going wrong. Usually, it is a series of ignorance— lack of physical exercise, compromising on sleep, food choices & stress.  All these will interact and then compound. I realised the process late in my life though. \n\nIt's very rare to meet people who are driven by genuine curiosity and passion to learn a new skill. Priyanka is one of them. \n\nLink to the full podcast in the comment section below.",
    "url": "https://www.linkedin.com/posts/dilipevs_fitness-entrepreneur-podcast-activity-7027589729839693824-O31E?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "quote"
  },
  {
    "full_urn": "urn:li:ugcPost:7027174962935328768",
    "text": "Nithin Kamath invites competition. But not in stock brokerage. \n\n\nYou should watch the full episode to understand why every entrepreneur should also be a sports person. All the guest i spoke with on my podcast have this common trait of playing some sport. Why?\n\nOfcourse you gain fitness.\n\nBut there are benefits beyond that. What are they?\n\n- Develops a mindset to deal with pressure and competition. \n- Builds mental models for proactive thinking and problem solving. \n- Learning from injuries will prepare you to handle failures. \n- Builds mental toughness. Every game starts with zero. \n- Teamwork. Giving up the ‘Me’ for the ‘We’.\n- Sometimes playing defense can be a superpower. \n- Everyone has a shelf life. Nithin calls it the ‘energy efficiency’ \n\nWhat sport do you play that has benefitted you the most? \n\n#fitness  #podcast #entrepreneur #startup #sports #health",
    "url": "https://www.linkedin.com/posts/dilipevs_fitness-podcast-entrepreneur-activity-7027175119756156928-ce7T?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7020640329997434880",
    "text": "A poignant reminder to everyone. Watch this now. You could be a founder, C level executive, manager, team leader or just getting into professional world. \n\nRecalling the evocative thoughts shared by Nithin & Rajiv in the podcast earlier https://lnkd.in/g5yPHgC9\n\nNithin -  \"How you take care of your health post 35 is what determines quality of life post 60. Backcasting is a powerful tool. Start working on it today.\"\n\nRajiv - \"If the avg lifespan is 80, after 37.5 years of age you’re no longer a time billionaire. You don’t have more than billion seconds to live. That’s the time wealth everyone has got. Regardless what your net worth is or assets you have made. Invest your time on your health.\"\n\nThird episode of the podcast releases end of this week. \n\nVideo credits to Heart & Stroke foundation, Canada.",
    "url": "https://www.linkedin.com/posts/dilipevs_a-poignant-reminder-to-everyone-watch-this-activity-7020640409651486720-LGB8?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:7019556923045806080",
    "text": "This weekend will see the biggest marathon of the country unfold.\n\nTata Mumbai Marathon 2023!\n\nThis is a summary of my learnings from the last two marathons i ran\n\nWhy is it relevant here?\nEveryone on Linkedin is an athlete of some kind. \nRunning a marathon of some kind. \n\nAs an entrepreneur, leader, manager or colleague.\nAs a parent, friend, child or sibling.\n\nGood luck if you're running TMM this sunday!",
    "url": "https://www.linkedin.com/posts/dilipevs_finding-the-athlete-activity-7019556923859501056-SNfr?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:6657084441481043968",
    "text": "Getting up to emails like this \n\nImStrong",
    "url": "https://www.linkedin.com/posts/dilipevs_getting-up-to-emails-like-this-imstrong-activity-6657084441481043968-tk8J?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:activity:6647839114026680320",
    "text": "Super excited to share this news! \n\nWe are on a mission to build the most convenient fitness solution. We are reimagining #onlinefitness by partnering with fitness & yoga trainers around the world. \n\nSelvan, Deepti and I are lucky to have a talented team and hope together we build a rocketship. Thanks, Nithin & Raghunandan for the support!",
    "url": "https://www.linkedin.com/posts/dilipevs_funding-alert-online-fitness-startup-imstrong-activity-6647839114026680320-njKY?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "quote"
  },
  {
    "full_urn": "urn:li:activity:6607893693569560576",
    "text": "The amazing Manish Pole on ImStrong . Experience the immersive live, yoga and fitness classes from anywhere in the world.",
    "url": "https://www.linkedin.com/posts/dilipevs_21stcenturyyogi-totalyoga-meditation-activity-6607893693569560576-RdvT?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "quote"
  },
  {
    "full_urn": "urn:li:activity:6580337132559261696",
    "text": "A fit body, a calm mind, a house full of love. These things cannot be bought, they must be earned - Naval Ravikant\n\nAs startup founders, how much time do you invest in your mental & physical fitness?\n\nFounders priority list presented by Adora Cheung at YCombinator last week 👇",
    "url": "https://www.linkedin.com/posts/dilipevs_a-fit-body-a-calm-mind-a-house-full-of-activity-6580337132559261696-igdS?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  },
  {
    "full_urn": "urn:li:ugcPost:6573093307658928128",
    "text": "Very excited to launch ImStrong today. It’s the most convenient fitness solution for busy people. Why we built it https://lnkd.in/ftxc-5S\n\nCome, experience ImStrong at www.imstrong.co\nSTRONG. It’s a feeling. It’s a calling. It's in everyone.\n\nSelvan Thamarai Deepti Nair Raghunandan GNithin Kamath Dilip Kumar Kichu J Thomas Naveen Vignesh Kez Klein Devrath Vijay Urmi Kothari Austin P.\n#FitIndiaMovement",
    "url": "https://www.linkedin.com/posts/dilipevs_fitindiamovement-activity-6573093453952061440-QeKS?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAGGyYTABZYVmghwuwqRrX-VlnPFbyLxAg4M",
    "post_type": "regular"
  }
]